In [49]:
import pandas as pd
import tensorflow_hub as hub
import openai 
import numpy as np
import altair as alt
from openai import OpenAI
from sql_metadata import Parser
import os
from IPython.display import display, Markdown

# Read the MIT DW queries

In [157]:
df_q_original = pd.read_json('data/original_queries.json')

In [150]:
df_q_original

,questions,sql
0,How many organisation units in human ressource...,SELECT count(*) from (select hr_org_unit_key f...
1,How many organisation units in human ressource...,SELECT count(*) from (select hr_org_unit_key f...
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count..."
3,"What are the past, upcoming, and, current cour...","select distinct subject_title, effective_term_..."
4,Which faculty has had the most location changes?,select max(cnt) from (select count(*) as cnt f...
5,What is the average number of courses a studen...,select avg(cnt) from (select count(*) as cnt f...
6,Which students are beeing employed by mit?,select distinct empl.full_name from mit_studen...
7,what is the shortest course available this sem...,"select distinct subject_title, term_end_date-t..."
8,Show buildings and their adress.,"SELECT fb.building_name, fba.* FROM wareuser.f..."
9,How many students do we have?,select count(*) from mit_student_directory;
10,Show all statuses for materials?,select distinct library_material_status from l...
11,What are the different cities where people live?,select distinct city_name from zip_usa union s...
12,Give the average number of courses in one depa...,select avg(offered_subject_nr) from (select di...
13,Count the number of room in a building.,"select distinct BUILDING_NAME_LONG, count(*) o..."
14,Count the number of space-units per building.,"select distinct BUILDING_NAME_LONG, count(*) o..."
15,For courses that have descriptions of Regular ...,select count(*) from cis_course_catalog where ...
16,What are the names of the 3 departments which ...,select * from (select distinct department_name...
17,Where is Prof. Michael Stonbraker's office?,"select Room, floor, fac_building_address.* fro..."
18,Which employees at MIT have a namesake?,"select distinct MIT_ID, employee.* from(select..."
19,Show the name for subjects which are enrollabl...,"select distinct se.subject_id, se.subject_titl..."
20,How many students does each department have?,"select department_name, count(*) over (partiti..."
21,what categories are there for independent acti...,select distinct IAP_CATEGORY_NAME from IAP_SUB...
22,Find the city with the post code 501.,"select count(*) from( (select zip_code, city_n..."
23,How many employees are there all in all?,select count(distinct MIT_ID) from employee_di...
24,How many departments does each school have?,"select distinct school_name, count(department_..."
25,"Show the name, kerberos credentials, and email...","select full_name, krb_name, email_address from..."
26,Show the school with the largest number of dep...,select * from (select * from(select distinct s...
27,What are the courses with the maximum number o...,"select * from COURSE_CATALOG_SUBJECT_OFFERED, ..."
28,What is the TDL for Brazil?,select * from top_level_domain where top_level...
29,What are all the different start dates of cour...,"select disitcnt * from( select subject_title, ..."
30,List the courses and format for all courses th...,"select distinct subject_title, form_type, num_..."
31,Which textbook-material is used the most often?,"select * from (select c.title, c.isbn, count(*..."
32,"Show activity title, location, and supervisor ...","select distinct activity_title, session_locati..."
33,What are the titles and isbn numbers for all m...,"select distinct title, isbn, new_shelf_price f..."
34,Which were the first registered subjects?,"select subject_title from subject_summary c, a..."
35,How many departments have less than 300 stude...,"select count(*) (select department_name, count..."
36,which depatment has the most kinds of payroll ...,select * from (select distinct department_name...

### Use the one that is reformatted and slightly cleaned.

In [208]:
df_q = pd.read_json('data/queries.json')

In [209]:
df_q

,questions,sql
0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...
1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count..."
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_..."
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...
5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...
6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...
7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -..."
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.f..."
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...
11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...
12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...
13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O..."
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O..."
15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...
16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...
17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO..."
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC..."
19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl..."
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI..."
21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n..."
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_..."
25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM..."
26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...
27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ..."
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...
29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ..."
30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_..."
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*..."
32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati..."
33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F..."
34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a..."
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ..."
36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...

## Rename the _questions_ column as _question_

In [210]:
df_q = df_q.rename(columns={"questions":"question"})

## Identify the tables used by each query

In [211]:
tables = []
for q in df_q['sql']: 
    t = Parser(q).tables
    tables.append([v.upper() for v in t])
df_q['tables'] = tables

## Identify the unique tables referred by the corpus

In [212]:
unique_tables = set()
for  l in tables: 
    for t in l:
        unique_tables.add(t.upper())

In [214]:
unique_tables

{'ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'EMPLOYEE_DIRECTORY',
 'FCLT_BUILDING',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_MATERIAL_STATUS',
 'MIT_STUDENT_DIRECTORY',
 'SPACE_UNIT',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'WAREUSER.CIS_COURSE_CATALOG',
 'WAREUSER.FAC_BUILDING',
 'WAREUSER.FAC_BUILDING_ADDRESS',
 'WAREUSER.FCLT_BUILDING_ADDRESS_HIST',
 'WAREUSER.SE_PERSON',
 'ZIP_CANADA',
 'ZIP_USA'}

In [215]:
len(unique_tables)

32

In [216]:
prefix='data/views/'

## Go thrugh the `unique_tables` list and save the respective schemas as proper CSV files

In [217]:
for t in unique_tables: 
    schema_file = prefix + 'schema/' + t + '.csv'
    if os.path.isfile(schema_file): 
        s = pd.read_csv(schema_file, header=None)
        s = s.drop(1) # delete the "header" line 
        column_names = [h.strip() for h in s[0][0].split(';')]
        s_new = pd.DataFrame(list(s[0][1:].apply(lambda row: [c.strip() for c in row.split(';')])), columns=column_names)
        new_schema_file = prefix + 'schema_new/' + t + '.csv'
        s_new.to_csv(new_schema_file, index=False)

# Treat ChatGPT as an all-knowing oracle
## Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at 
MIT, containing information about students, faculty, and personnel. You can find more about the MIT data 
warehouse tables at https://web.mit.edu/warehouse/metadata/tables/all_tables.html._

_How many organisation units in human resources are relabeled?_

In [218]:
key = os.environ['OPENAI_API_KEY']

In [219]:
client = OpenAI(api_key=key)

## Populate the prompt and call the Open AI API

In [ ]:
# TODO: do this in batch 
gpt_sql_nocontext = []
for q in df_q['question']: 
    response = client.chat.completions.create(
      model="gpt-4",
      messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. You can find more about the MIT data warehouse tables at \
          https://web.mit.edu/warehouse/metadata/tables/all_tables.html. \
          Reply with only the answer in SQL and include no linebreaks, newlines, escape characters or other commentary."
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    gpt_sql_nocontext.append(response.choices[0].message.content)

In [164]:
df_q['gpt_sql_nocontext']=gpt_sql_nocontext

In [168]:
df_q

,question,sql,tables,gpt_sql_nocontext
0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]",SELECT COUNT(*) FROM HR_ORGANIZATION_UNITS WHE...
1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]",SELECT COUNT(*) FROM human_resources WHERE new...
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count...",[WAREUSER.CIS_COURSE_CATALOG],"""SELECT department_id, COUNT(*) FROM Courses G..."
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_...","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]",SELECT * FROM courses WHERE course_start_date ...
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...,[WAREUSER.FCLT_BUILDING_ADDRESS_HIST],"SELECT faculty_id, COUNT(DISTINCT location_id)..."
5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...,"[MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]",SELECT AVG(course_count) FROM (SELECT student_...
6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...,"[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]","SELECT s.student_id, s.first_name, s.last_name..."
7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -...","[ACADEMIC_TERMS, CIS_COURSE_CATALOG]","SELECT MIN(course_length), course_name FROM co..."
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.f...","[WAREUSER.FAC_BUILDING, WAREUSER.FAC_BUILDING_...","SELECT building_number, building_name, street_..."
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,[MIT_STUDENT_DIRECTORY],SELECT COUNT(*) FROM students;
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...,"[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]",SELECT DISTINCT(status) FROM materials;
11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...,"[ZIP_USA, ZIP_CANADA]",SELECT DISTINCT city FROM person;
12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...,[SUBJECT_OFFERED],SELECT AVG(course_count) FROM (SELECT departme...
13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","[FCLT_ROOMS, FCLT_BUILDING]","""SELECT COUNT(*) FROM rooms WHERE building_id ..."
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","[SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]","SELECT building_id, COUNT(space_unit_id) AS Nu..."
15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...,[CIS_COURSE_CATALOG],SELECT start_date FROM courses WHERE descripti...
16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...,[CIS_COURSE_CATALOG],"SELECT department_name, COUNT(*) AS course_cou..."
17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO...",[EMPLOYEE_DIRECTORY],SELECT office_location FROM faculty_info WHERE...
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC...",[EMPLOYEE_DIRECTORY],"SELECT a.employee_id, a.employee_name FROM mit..."
19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl...","[SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]","""SELECT subject_name FROM subjects WHERE enrol..."
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI...",[MIT_STUDENT_DIRECTORY],"SELECT department_id, COUNT(student_id) AS stu..."
21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,[IAP_SUBJECT_CATEGORY],SELECT DISTINCT category FROM independent_acti...
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n...","[ZIP_USA, ZIP_CANADA]",SELECT city FROM addresses WHERE postcode = 501;
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...,[EMPLOYEE_DIRECTORY],SELECT COUNT(*) FROM employees
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_...",[STUDENT_DEPARTMENT],"SELECT school_name, COUNT(department_name) as ..."
25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM...",[EMPLOYEE_DIRECTORY],"SELECT name, kerberos_id, email FROM employees..."
26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...,[STUDENT_DEPARTMENT],"SELECT SCHOOL_NAME FROM \n(SELECT SCHOOL_NAME,..."
27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ...",[COURSE_CATALOG_SUBJECT_OFFERED],"SELECT course_id, course_name FROM courses WHE..."
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...,[TOP_LEVEL_DOMAIN],SELECT TDL FROM TDL_Country WHERE Country_Name...
29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ...","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM...",SELECT start_date FROM courses WHERE departmen...
30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_...",[SUBJECT_OFFERED],"SELECT course_name, format FROM Courses WHERE ..."
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*...","[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]","SELECT textbook_material, COUNT(*) AS usage_co..."
32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati...","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE...","""SELECT activity_title, location, supervisor F..."
33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F...",[TIP_MATERIAL],"SELECT title, isbn FROM materials ORDER BY pri..."
34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a...","[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]",SELECT * FROM subjects ORDER BY registration_d...
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ...",[MIT_STUDENT_DIRECTORY],SELECT COUNT(*) FROM Departments WHERE NumberO...
36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...,"[WAREUSER.SE_PERSON, EMPLOYEE_DIRECTORY]","SELECT department_id, COUNT(DISTINCT payroll_r..."

# Give ChatGPT the "database" schema as context and elicit its answer

## Build the schema prompt

In [137]:
def table_to_sql_create(t): 
    schema_file=prefix + 'schema_new/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t = pd.read_csv(schema_file)
        p = "CREATE TABLE "+ t+ "(\n"  
        p = p + '\n'.join(list(df_t[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
    return p

In [175]:
prompt = "** all the tables in the database ** \n\n"
cnt = 0 
for t in unique_tables:
    p = table_to_sql_create(t)
    if not p: 
        print(t)
    if p: 
        cnt = cnt + 1
        prompt = prompt + p
        prompt = prompt + "\n\n"

WAREUSER.FAC_BUILDING
WAREUSER.FCLT_BUILDING_ADDRESS_HIST
WAREUSER.FAC_BUILDING_ADDRESS
WAREUSER.CIS_COURSE_CATALOG
WAREUSER.SE_PERSON

### We seem to be missing some of the tables (above)

In [205]:
## The "schema" prompt, which we append to the system prompt below 
print(prompt)

** all the tables in the database **

CREATE TABLE ACADEMIC_TERMS(
ACADEMIC_TERMS_KEY VARCHAR2
TERM_CODE VARCHAR2
TERM_DESCRIPTION VARCHAR2
TERM_SELECTOR VARCHAR2
TERM_START_DATE DATE
TERM_END_DATE DATE
ACADEMIC_YEAR VARCHAR2
ACADEMIC_YEAR_DESC VARCHAR2
IS_CURRENT_TERM VARCHAR2
IS_REGULAR_TERM VARCHAR2
TERM_STATUS_INDICATOR VARCHAR2
TERM_STATUS VARCHAR2
FINANCIAL_AID_YEAR VARCHAR2
DEGREE_YEAR VARCHAR2
LAST_DAY_OF_FINAL_EXAM DATE
PRE_REGISTRATION_START_DAY DATE
REGISTRATION_DAY DATE
FIRST_DAY_OF_CLASSES DATE
LAST_DAY_OF_CLASSES DATE
ADD_DATE DATE
DROP_DATE DATE
GRADUATE_AWARD_START_DATE DATE
GRADUATE_AWARD_END_DATE DATE
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE EMPLOYEE_DIRECTORY(
MIT_ID VARCHAR2
LAST_NAME VARCHAR2
FIRST_NAME VARCHAR2
MIDDLE_NAME VARCHAR2
FULL_NAME VARCHAR2
DIRECTORY_FULL_NAME VARCHAR2
OFFICE_LOCATION VARCHAR2
OFFICE_PHONE VARCHAR2
DIRECTORY_TITLE VARCHAR2
PRIMARY_TITLE VARCHAR2
DEPARTMENT_NUMBER VARCHAR2
DEPARTMENT_NAME VARCHAR2
KRB_NAME VARCHAR2
KRB_NAME_UPPERCASE VARCHAR2
EMAIL_ADDRESS VARCHAR2
PERSONAL_URL VARCHAR2
NAME_KNOWN_BY VARCHAR2
EMAIL_ADDRESS_UPPERCASE VARCHAR2
FULL_NAME_UPPERCASE VARCHAR2
PREFERRED_FIRST_NAME_UPPER VARCHAR2
PREFERRED_LAST_NAME_UPPER VARCHAR2)


CREATE TABLE IAP_SUBJECT_CATEGORY(
IAP_SUBJECT_CATEGORY_KEY VARCHAR2
IAP_CATEGORY_NAME VARCHAR2
IAP_CATEGORY_DESC VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE CIS_COURSE_CATALOG(
IS_OFFERED_FALL_TERM VARCHAR2
IS_OFFERED_IAP VARCHAR2
IS_OFFERED_SPRING_TERM VARCHAR2
IS_OFFERED_SUMMER_TERM VARCHAR2
FALL_INSTRUCTORS VARCHAR2
SPRING_INSTRUCTORS VARCHAR2
STATUS_CHANGE VARCHAR2
LAST_ACTIVITY_DATE DATE
WAREHOUSE_LOAD_DATE DATE
MASTER_SUBJECT_ID VARCHAR2
HASS_ATTRIBUTE VARCHAR2
HASS_ATTRIBUTE_DESC VARCHAR2
TERM_DURATION VARCHAR2
GLOBAL_REGIONS VARCHAR2
GLOBAL_COUNTRIES VARCHAR2
ON_LINE_PAGE_NUMBER VARCHAR2
ACADEMIC_YEAR VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_CODE VARCHAR2
SUBJECT_NUMBER VARCHAR2
SOURCE_SUBJECT_ID VARCHAR2
PRINT_SUBJECT_ID VARCHAR2
IS_PRINTED_IN_BULLETIN VARCHAR2
DEPARTMENT_CODE VARCHAR2
DEPARTMENT_NAME VARCHAR2
EFFECTIVE_TERM_CODE VARCHAR2
SUBJECT_SHORT_TITLE VARCHAR2
SUBJECT_TITLE VARCHAR2
IS_VARIABLE_UNITS VARCHAR2
LECTURE_UNITS NUMBER
LAB_UNITS NUMBER
PREPARATION_UNITS NUMBER
TOTAL_UNITS NUMBER
DESIGN_UNITS NUMBER
GRADE_TYPE VARCHAR2
GRADE_TYPE_DESC VARCHAR2
GRADE_RULE VARCHAR2
GRADE_RULE_DESC VARCHAR2
HGN_CODE VARCHAR2
HGN_DESC VARCHAR2
HGN_EXCEPT VARCHAR2
GIR_ATTRIBUTE VARCHAR2
GIR_ATTRIBUTE_DESC VARCHAR2
COMM_REQ_ATTRIBUTE VARCHAR2
COMM_REQ_ATTRIBUTE_DESC VARCHAR2
TUITION_ATTRIBUTE VARCHAR2
TUITION_ATTRIBUTE_DESC VARCHAR2
WRITE_REQ_ATTRIBUTE VARCHAR2
WRITE_REQ_ATTRIBUTE_DESC VARCHAR2
SUPERVISOR_ATTRIBUTE VARCHAR2
SUPERVISOR_ATTRIBUTE_DESC VARCHAR2
PREREQUISITES VARCHAR2
SUBJECT_DESCRIPTION VARCHAR2
JOINT_SUBJECTS VARCHAR2
SCHOOL_WIDE_ELECTIVES VARCHAR2
MEETS_WITH_SUBJECTS VARCHAR2
EQUIVALENT_SUBJECTS VARCHAR2
IS_OFFERED_THIS_YEAR VARCHAR2)


CREATE TABLE COURSE_CATALOG_SUBJECT_OFFERED(
ACADEMIC_YEAR VARCHAR2
TERM_CODE VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_CODE VARCHAR2
SUBJECT_NUMBER VARCHAR2
SOURCE_SUBJECT_ID VARCHAR2
PRINT_SUBJECT_ID VARCHAR2
IS_PRINTED_IN_BULLETIN VARCHAR2
DEPARTMENT_CODE VARCHAR2
DEPARTMENT_NAME VARCHAR2
EFFECTIVE_TERM_CODE VARCHAR2
SUBJECT_SHORT_TITLE VARCHAR2
SUBJECT_TITLE VARCHAR2
IS_VARIABLE_UNITS VARCHAR2
LECTURE_UNITS NUMBER
LAB_UNITS NUMBER
PREPARATION_UNITS NUMBER
TOTAL_UNITS NUMBER
DESIGN_UNITS NUMBER
GRADE_TYPE VARCHAR2
GRADE_TYPE_DESC VARCHAR2
GRADE_RULE VARCHAR2
GRADE_RULE_DESC VARCHAR2
HGN_CODE VARCHAR2
HGN_DESC VARCHAR2
HGN_EXCEPT VARCHAR2
GIR_ATTRIBUTE VARCHAR2
GIR_ATTRIBUTE_DESC VARCHAR2
COMM_REQ_ATTRIBUTE VARCHAR2
COMM_REQ_ATTRIBUTE_DESC VARCHAR2
TUITION_ATTRIBUTE VARCHAR2
TUITION_ATTRIBUTE_DESC VARCHAR2
WRITE_REQ_ATTRIBUTE VARCHAR2
WRITE_REQ_ATTRIBUTE_DESC VARCHAR2
SUPERVISOR_ATTRIBUTE VARCHAR2
SUPERVISOR_ATTRIBUTE_DESC VARCHAR2
PREREQUISITES VARCHAR2
SUBJECT_DESCRIPTION VARCHAR2
JOINT_SUBJECTS VARCHAR2
SCHOOL_WIDE_ELECTIVES VARCHAR2
MEETS_WITH_SUBJECTS VARCHAR2
EQUIVALENT_SUBJECTS VARCHAR2
IS_OFFERED_THIS_YEAR VARCHAR2
IS_OFFERED_FALL_TERM VARCHAR2
IS_OFFERED_IAP VARCHAR2
IS_OFFERED_SPRING_TERM VARCHAR2
IS_OFFERED_SUMMER_TERM VARCHAR2
FALL_INSTRUCTORS VARCHAR2
SPRING_INSTRUCTORS VARCHAR2
STATUS_CHANGE VARCHAR2
LAST_ACTIVITY_DATE DATE
WAREHOUSE_LOAD_DATE DATE
MASTER_SUBJECT_ID VARCHAR2
HASS_ATTRIBUTE VARCHAR2
HASS_ATTRIBUTE_DESC VARCHAR2
TERM_DURATION VARCHAR2
GLOBAL_REGIONS VARCHAR2
GLOBAL_COUNTRIES VARCHAR2
ON_LINE_PAGE_NUMBER VARCHAR2
SECTION_ID VARCHAR2
IS_MASTER_SECTION VARCHAR2
IS_LECTURE_SECTION VARCHAR2
IS_LAB_SECTION VARCHAR2
IS_RECITATION_SECTION VARCHAR2
IS_DESIGN_SECTION VARCHAR2
RESPONSIBLE_FACULTY_NAME VARCHAR2
RESPONSIBLE_FACULTY_MIT_ID VARCHAR2
MEET_TIME VARCHAR2
MEET_PLACE VARCHAR2)


CREATE TABLE MIT_STUDENT_DIRECTORY(
FIRST_NAME VARCHAR2
MIDDLE_NAME VARCHAR2
LAST_NAME VARCHAR2
FULL_NAME VARCHAR2
OFFICE_LOCATION VARCHAR2
OFFICE_PHONE VARCHAR2
EMAIL_ADDRESS VARCHAR2
DEPARTMENT VARCHAR2
DEPARTMENT_NAME VARCHAR2
STUDENT_YEAR VARCHAR2
FULL_NAME_UPPERCASE VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE STUDENT_DEPARTMENT(
DEPARTMENT_CODE VARCHAR2
DEPARTMENT_NAME VARCHAR2
DEPARTMENT_FULL_NAME VARCHAR2
SCHOOL_CODE VARCHAR2
SCHOOL_NAME VARCHAR2)


CREATE TABLE IAP_SUBJECT_PERSON(
IAP_SUBJECT_PERSON_KEY VARCHAR2
PERSON_ROLE VARCHAR2
PERSON_MIT_AFFILIATION VARCHAR2
PERSON_NAME VARCHAR2
PERSON_LOCATION VARCHAR2
PERSON_EMAIL VARCHAR2
PERSON_ORGANIZATION VARCHAR2
PERSON_TITLE VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE HR_ORG_UNIT_NEW(
HR_ORG_UNIT_KEY VARCHAR2
HR_ORG_UNIT_ID VARCHAR2
HR_ORG_UNIT_TITLE VARCHAR2
HR_ORG_UNIT_LEVEL VARCHAR2
HR_DEPARTMENT_CODE VARCHAR2
HR_DEPARTMENT_ABBR VARCHAR2
HR_DEPARTMENT_CODE_OLD VARCHAR2
HR_DEPARTMENT_NAME VARCHAR2
HR_DEPARTMENT_NAME_LONG VARCHAR2
HR_DEPARTMENT_NAME_ALPHA VARCHAR2
ORG_HIER_SCHOOL_AREA_NAME VARCHAR2
ORG_HIER_TOP_LEVEL_NAME VARCHAR2
ORG_HIER_ROOT_NAME VARCHAR2
HR_ORG_LEVEL1_ID VARCHAR2
HR_ORG_LEVEL1_SORT VARCHAR2
HR_ORG_LEVEL1_NAME VARCHAR2
HR_ORG_LEVEL2_ID VARCHAR2
HR_ORG_LEVEL2_SORT VARCHAR2
HR_ORG_LEVEL2_NAME VARCHAR2
HR_ORG_LEVEL3_ID VARCHAR2
HR_ORG_LEVEL3_SORT VARCHAR2
HR_ORG_LEVEL3_NAME VARCHAR2
HR_ORG_LEVEL4_ID VARCHAR2
HR_ORG_LEVEL4_SORT VARCHAR2
HR_ORG_LEVEL4_NAME VARCHAR2
HR_ORG_LEVEL5_ID VARCHAR2
HR_ORG_LEVEL5_SORT VARCHAR2
HR_ORG_LEVEL5_NAME VARCHAR2
DLC_KEY VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE SUBJECT_OFFERED(
SUBJECT_KEY VARCHAR2
SUBJECT_OFFERED_SUMMARY_KEY VARCHAR2
MASTER_SUBJECT_KEY VARCHAR2
COMPOSITE_SUBJECT_KEY VARCHAR2
TERM_CODE VARCHAR2
MASTER_COURSE_NUMBER VARCHAR2
MASTER_COURSE_NUMBER_SORT VARCHAR2
MASTER_COURSE_NUMBER_DESC VARCHAR2
MASTER_SUBJECT_ID VARCHAR2
MASTER_SUBJECT_ID_SORT VARCHAR2
COURSE_NUMBER VARCHAR2
COURSE_NUMBER_SORT VARCHAR2
COURSE_NUMBER_DESC VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_ID_SORT VARCHAR2
SUBJECT_TITLE VARCHAR2
SECTION_ID VARCHAR2
IS_MASTER_SECTION VARCHAR2
IS_LECTURE_SECTION VARCHAR2
IS_LAB_SECTION VARCHAR2
IS_RECITATION_SECTION VARCHAR2
IS_DESIGN_SECTION VARCHAR2
OFFER_DEPT_CODE VARCHAR2
OFFER_DEPT_NAME VARCHAR2
OFFER_SCHOOL_NAME VARCHAR2
RESPONSIBLE_FACULTY_NAME VARCHAR2
RESPONSIBLE_FACULTY_MIT_ID VARCHAR2
MEET_TIME VARCHAR2
MEET_PLACE VARCHAR2
CLUSTER_TYPE VARCHAR2
CLUSTER_TYPE_DESC VARCHAR2
CLUSTER_LIST VARCHAR2
HGN_CODE VARCHAR2
HGN_CODE_DESC VARCHAR2
FORM_TYPE VARCHAR2
FORM_TYPE_DESC VARCHAR2
SUBJECT_ENROLLMENT_NUMBER NUMBER
SECTION_ENROLLMENT_NUMBER VARCHAR2
CLUSTER_ENROLLMENT_NUMBER NUMBER
EVALUATE_THIS_SUBJECT VARCHAR2
IS_OSE_SUBJECT VARCHAR2
IS_CREATED_BY_DATA_WAREHOUSE VARCHAR2
SUBJECT_GROUPING_KEY VARCHAR2
WAREHOUSE_LOAD_DATE DATE
NUM_ENROLLED_STUDENTS NUMBER
SUBJECT_SUMMARY_KEY VARCHAR2
IS_REPEATABLE_SUBJECT VARCHAR2)


CREATE TABLE IAP_SUBJECT_SESSION(
IAP_SUBJECT_SESSION_KEY VARCHAR2
SESSION_SEQUENCE NUMBER
SESSION_TITLE VARCHAR2
SESSION_DESCRIPTION VARCHAR2
SESSION_LOCATION VARCHAR2
SESSION_DATE DATE
SESSION_START_TIME VARCHAR2
SESSION_END_TIME VARCHAR2
HAS_SESSION_INFO VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE ACADEMIC_TERMS_ALL(
ACADEMIC_TERMS_KEY VARCHAR2
TERM_CODE VARCHAR2
TERM_DESCRIPTION VARCHAR2
TERM_SELECTOR VARCHAR2
TERM_START_DATE DATE
TERM_END_DATE DATE
ACADEMIC_YEAR VARCHAR2
ACADEMIC_YEAR_DESC VARCHAR2
IS_CURRENT_TERM VARCHAR2
TERM_STATUS_INDICATOR VARCHAR2
FINANCIAL_AID_YEAR VARCHAR2
DEGREE_YEAR VARCHAR2
LAST_DAY_OF_FINAL_EXAM DATE
PRE_REGISTRATION_START_DAY DATE
REGISTRATION_DAY DATE
FIRST_DAY_OF_CLASSES DATE
LAST_DAY_OF_CLASSES DATE
GRADUATE_AWARD_START_DATE DATE
GRADUATE_AWARD_END_DATE DATE
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE FCLT_ROOMS(
FCLT_ROOM_KEY VARCHAR2
BUILDING_ROOM VARCHAR2
FCLT_BUILDING_KEY VARCHAR2
FLOOR VARCHAR2
FCLT_FLOOR_KEY VARCHAR2
ROOM VARCHAR2
SPACE_ID VARCHAR2
FCLT_MAJOR_USE_KEY VARCHAR2
MAJOR_USE_DESC VARCHAR2
FCLT_USE_KEY VARCHAR2
USE_DESC VARCHAR2
FCLT_MINOR_USE_KEY VARCHAR2
MINOR_USE_DESC VARCHAR2
FCLT_ORGANIZATION_KEY VARCHAR2
ORGANIZATION_NAME VARCHAR2
FCLT_MINOR_ORGANIZATION_KEY VARCHAR2
MINOR_ORGANIZATION VARCHAR2
AREA NUMBER
ROOM_FULL_NAME VARCHAR2
DEPT_CODE VARCHAR2
ACCESS_LEVEL VARCHAR2
LATITUDE_WGS NUMBER
LONGITUDE_WGS NUMBER
NORTHING_SPCS NUMBER
EASTING_SPCS NUMBER
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE TIP_MATERIAL_STATUS(
TIP_MATERIAL_STATUS_KEY VARCHAR2
TIP_MATERIAL_STATUS_CODE VARCHAR2
TIP_MATERIAL_STATUS VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE TIP_MATERIAL(
TIP_MATERIAL_KEY VARCHAR2
ISBN VARCHAR2
TITLE VARCHAR2
AUTHOR VARCHAR2
EDITION VARCHAR2
PUBLISHER VARCHAR2
YEAR VARCHAR2
NEW_SHELF_PRICE NUMBER
USED_SHELF_PRICE NUMBER
RENTAL_NEW_PRICE NUMBER
RENTAL_USED_PRICE NUMBER
MATERIAL_INFO_SOURCE VARCHAR2)


CREATE TABLE IAP_SUBJECT_DETAIL(
IAP_SUBJECT_CATEGORY_KEY VARCHAR2
IAP_SUBJECT_SPONSOR_KEY VARCHAR2
IAP_SUBJECT_SESSION_KEY VARCHAR2
IAP_SUBJECT_PERSON_KEY VARCHAR2
ACTIVITY_TITLE VARCHAR2
ACTIVITY_DESCRIPTION VARCHAR2
TERM_CODE VARCHAR2
ENROLLMENT_TYPE VARCHAR2
MAX_ENROLLMENT NUMBER
ATTENDANCE VARCHAR2
PREREQUISITES VARCHAR2
FEE NUMBER
FEE_REASON VARCHAR2
PREREG_DEADLINE DATE
CREATE_DATE DATE
LAST_ACTIVITY_DATE DATE
IS_MULTIPLE_SESSION VARCHAR2
IS_CANCELLED VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE FCLT_BUILDING(
FCLT_BUILDING_KEY VARCHAR2
BUILDING_NUMBER VARCHAR2
PARENT_BUILDING_NUMBER VARCHAR2
PARENT_BUILDING_NAME VARCHAR2
PARENT_BUILDING_NAME_LONG VARCHAR2
BUILDING_NAME_LONG VARCHAR2
EXT_GROSS_AREA NUMBER
ASSIGNABLE_AREA NUMBER
NON_ASSIGNABLE_AREA NUMBER
SITE VARCHAR2
CAMPUS_SECTOR VARCHAR2
ACCESS_LEVEL_CODE NUMBER
ACCESS_LEVEL_NAME VARCHAR2
BUILDING_TYPE VARCHAR2
OWNERSHIP_TYPE VARCHAR2
BUILDING_USE VARCHAR2
OCCUPANCY_CLASS VARCHAR2
BUILDING_HEIGHT VARCHAR2
COST_CENTER_CODE VARCHAR2
COST_COLLECTOR_KEY VARCHAR2
LATITUDE_WGS NUMBER
LONGITUDE_WGS NUMBER
EASTING_X_SPCS NUMBER
NORTHING_Y_SPCS NUMBER
BUILDING_SORT VARCHAR2
BUILDING_NAMED_FOR VARCHAR2
BUILDING_NAME VARCHAR2
DATE_BUILT VARCHAR2
DATE_ACQUIRED VARCHAR2
DATE_OCCUPIED VARCHAR2
WAREHOUSE_LOAD_DATE DATE
NUM_OF_ROOMS NUMBER)


CREATE TABLE SPACE_UNIT(
FCLT_ORGANIZATION_KEY VARCHAR2
SPACE_UNIT_KEY VARCHAR2
SPACE_UNIT_CODE VARCHAR2
SPACE_UNIT VARCHAR2
DLC_KEY VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE SUBJECT_SUMMARY(
SUBJECT_SUMMARY_KEY VARCHAR2
TERM_CODE VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_ID_SORT VARCHAR2
SUBJECT_TITLE VARCHAR2
SUBJECT_OR_CLUSTER VARCHAR2
MASTER_SUBJECT_ID VARCHAR2
MASTER_SUBJECT_ID_SORT VARCHAR2
ULT_MASTER_SUBJECT_ID VARCHAR2
CLUSTER_TYPE VARCHAR2
CLUSTER_TYPE_DESC VARCHAR2
CLUSTER_LIST VARCHAR2
DEPARTMENT_CODE VARCHAR2
DEPARTMENT_NAME VARCHAR2
SCHOOL_CODE VARCHAR2
SCHOOL_NAME VARCHAR2
TOTAL_UNITS NUMBER
LECTURE_UNITS NUMBER
LAB_UNITS NUMBER
PREP_UNITS NUMBER
DESIGN_UNITS NUMBER
SUBJECT_ENROLLMENT_NUMBER NUMBER
CLUSTER_ENROLLMENT_NUMBER NUMBER
SUBJECT_GROUP_ID VARCHAR2
SUBJECT_ENROLLMENT_FIRST_WEEK NUMBER
CLUSTER_ENROLLMENT_FIRST_WEEK NUMBER
SUBJECT_ENROLLMENT_FIFTH_WEEK NUMBER
CLUSTER_ENROLLMENT_FIFTH_WEEK NUMBER
SUBJECT_ENROLLMENT_CREDIT NUMBER
SUBJECT_ENROLLMENT_LISTEN NUMBER
CLUSTER_ENROLLMENT_CREDIT NUMBER
CLUSTER_ENROLLMENT_LISTEN NUMBER
SUBJECT_ENROLLMENT_1ST_CREDIT NUMBER
SUBJECT_ENROLLMENT_1ST_LISTEN NUMBER
CLUSTER_ENROLLMENT_1ST_CREDIT NUMBER
CLUSTER_ENROLLMENT_1ST_LISTEN NUMBER
SUBJECT_ENROLLMENT_5TH_CREDIT NUMBER
SUBJECT_ENROLLMENT_5TH_LISTEN NUMBER
CLUSTER_ENROLLMENT_5TH_CREDIT NUMBER
CLUSTER_ENROLLMENT_5TH_LISTEN NUMBER
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE TIP_DETAIL(
TIP_SUBJECT_OFFERED_KEY VARCHAR2
TIP_MATERIAL_KEY VARCHAR2
TIP_MATERIAL_STATUS_KEY VARCHAR2
TERM_CODE VARCHAR2
SUBJECT_ID VARCHAR2
ISBN VARCHAR2
RECORD_COUNT NUMBER
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE HR_ORG_UNIT(
HR_ORG_UNIT_KEY VARCHAR2
HR_ORG_UNIT_ID VARCHAR2
HR_ORG_UNIT_TITLE VARCHAR2
HR_ORG_UNIT_LEVEL VARCHAR2
HR_DEPARTMENT_ID VARCHAR2
HR_DEPARTMENT_CODE VARCHAR2
HR_DEPARTMENT_CODE_OLD VARCHAR2
HR_DEPARTMENT_NAME VARCHAR2
HR_DEPARTMENT_NAME_LONG VARCHAR2
HR_DEPARTMENT_NAME_ALPHA VARCHAR2
ORG_HIER_SCHOOL_AREA_NAME VARCHAR2
ORG_HIER_TOP_LEVEL_NAME VARCHAR2
ORG_HIER_ROOT_NAME VARCHAR2
HR_ORG_LEVEL1_ID VARCHAR2
HR_ORG_LEVEL1_SORT VARCHAR2
HR_ORG_LEVEL1_NAME VARCHAR2
HR_ORG_LEVEL2_ID VARCHAR2
HR_ORG_LEVEL2_SORT VARCHAR2
HR_ORG_LEVEL2_NAME VARCHAR2
HR_ORG_LEVEL3_ID VARCHAR2
HR_ORG_LEVEL3_SORT VARCHAR2
HR_ORG_LEVEL3_NAME VARCHAR2
HR_ORG_LEVEL4_ID VARCHAR2
HR_ORG_LEVEL4_SORT VARCHAR2
HR_ORG_LEVEL4_NAME VARCHAR2
HR_ORG_LEVEL5_ID VARCHAR2
HR_ORG_LEVEL5_SORT VARCHAR2
HR_ORG_LEVEL5_NAME VARCHAR2
HR_ORG_LEVEL6_ID VARCHAR2
HR_ORG_LEVEL6_SORT VARCHAR2
HR_ORG_LEVEL6_NAME VARCHAR2
HR_ORG_LEVEL7_ID VARCHAR2
HR_ORG_LEVEL7_SORT VARCHAR2
HR_ORG_LEVEL7_NAME VARCHAR2
DLC_KEY VARCHAR2
DLC_NAME VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE TIP_SUBJECT_OFFERED(
TIP_SUBJECT_OFFERED_KEY VARCHAR2
TERM_CODE VARCHAR2
IS_NO_COURSE_MATERIAL VARCHAR2
MASTER_COURSE_NUMBER VARCHAR2
MASTER_COURSE_NUMBER_SORT VARCHAR2
MASTER_COURSE_NUMBER_DESC VARCHAR2
MASTER_SUBJECT_ID VARCHAR2
MASTER_SUBJECT_ID_SORT VARCHAR2
COURSE_NUMBER VARCHAR2
COURSE_NUMBER_SORT VARCHAR2
COURSE_NUMBER_DESC VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_ID_SORT VARCHAR2
SUBJECT_TITLE VARCHAR2
OFFER_DEPT_CODE VARCHAR2
OFFER_DEPT_NAME VARCHAR2
OFFER_SCHOOL_NAME VARCHAR2
RESPONSIBLE_FACULTY_NAME VARCHAR2
RESPONSIBLE_FACULTY_MIT_ID VARCHAR2
NUM_ENROLLED_STUDENTS NUMBER
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE ZIP_USA(
STATE_NAME VARCHAR2
WAREHOUSE_LOAD_DATE DATE
ZIP_CODE VARCHAR2
ZIP_TYPE VARCHAR2
CITY_NAME VARCHAR2
CITY_TYPE VARCHAR2
COUNTY_NAME VARCHAR2
STATE_ABBR VARCHAR2)


CREATE TABLE SUBJECT_ENROLLABLE(
TERM_CODE VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_TITLE VARCHAR2
SUBJECT_TITLE_LONG VARCHAR2
MASTER_SUBJECT_ID VARCHAR2
ULT_MASTER_SUBJECT_ID VARCHAR2
CLUSTER_LIST VARCHAR2
OFFER_DEPT_CODE VARCHAR2
OFFER_SCHOOL_CODE VARCHAR2
SUBJECT_GROUP_ID VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE TOP_LEVEL_DOMAIN(
TOP_LEVEL_DOMAIN_KEY VARCHAR2
TOP_LEVEL_DOMAIN VARCHAR2
TOP_LEVEL_DOMAIN_DESCRIPTION VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE LIBRARY_MATERIAL_STATUS(
LIBRARY_MATERIAL_STATUS_KEY VARCHAR2
LIBRARY_MATERIAL_STATUS_CODE VARCHAR2
LIBRARY_MATERIAL_STATUS VARCHAR2
WAREHOUSE_LOAD_DATE DATE)


CREATE TABLE ZIP_CANADA(
POSTAL_CODE VARCHAR2
CITY_NAME VARCHAR2
CITY_TYPE VARCHAR2
PROVINCE_ABBR VARCHAR2
PROVINCE_NAME VARCHAR2
WAREHOUSE_LOAD_DATE DATE)

## We're now ready to make the api call

In [143]:
gpt_sql_global_schema = []
for q in df_q['question']: 
    response = client.chat.completions.create(
      model="gpt-4",
      messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of the all the tables that you might need \
          for answering the user questions are below. There are 27 tables in the database.  Reply with only the answer \
          in SQL and include no linebreaks, newlines, escape characters or other commentary.\n\n" + prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    gpt_sql_global_schema.append(response.choices[0].message.content)

In [200]:
df_q['gpt_sql_global_schema']=gpt_sql_global_schema

In [202]:
df_q.to_csv('data/gpt_sql_v0.csv', index=False)

In [277]:
df_q = pd.read_csv('data/gpt_sql_v0.csv')

In [223]:
df_q

,question,sql,tables_referred,gpt_sql_nocontext,gpt_sql_global_schema
0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM HR_ORGANIZATION_UNITS WHE...,SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_...
1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM human_resources WHERE new...,SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_...
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count...",['WAREUSER.CIS_COURSE_CATALOG'],"""SELECT department_id, COUNT(*) FROM Courses G...","SELECT DEPARTMENT_NAME, COUNT(*) FROM COURSE_C..."
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_...","['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS']",SELECT * FROM courses WHERE course_start_date ...,"SELECT SUBJECT_ID, SUBJECT_TITLE, TERM_CODE FR..."
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...,['WAREUSER.FCLT_BUILDING_ADDRESS_HIST'],"SELECT faculty_id, COUNT(DISTINCT location_id)...","SELECT EMPLOYEE_DIRECTORY.FULL_NAME, COUNT(FCL..."
5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...,"['MIT_STUDENT_DIRECTORY', 'SUBJECT_ENROLLABLE']",SELECT AVG(course_count) FROM (SELECT student_...,SELECT AVG(NUM_ENROLLED_STUDENTS) FROM SUBJECT...
6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...,"['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY']","SELECT s.student_id, s.first_name, s.last_name...","SELECT FIRST_NAME, LAST_NAME FROM MIT_STUDENT_..."
7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -...","['ACADEMIC_TERMS', 'CIS_COURSE_CATALOG']","SELECT MIN(course_length), course_name FROM co...","SELECT SUBJECT_TITLE, MIN(TERM_DURATION) AS MI..."
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.f...","['WAREUSER.FAC_BUILDING', 'WAREUSER.FAC_BUILDI...","SELECT building_number, building_name, street_...","SELECT BUILDING_NUMBER, BUILDING_NAME, LATITUD..."
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,['MIT_STUDENT_DIRECTORY'],SELECT COUNT(*) FROM students;,SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...,"['LIBRARY_MATERIAL_STATUS', 'TIP_MATERIAL_STAT...",SELECT DISTINCT(status) FROM materials;,SELECT * FROM LIBRARY_MATERIAL_STATUS;
11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...,"['ZIP_USA', 'ZIP_CANADA']",SELECT DISTINCT city FROM person;,SELECT DISTINCT CITY_NAME FROM ZIP_USA UNION S...
12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...,['SUBJECT_OFFERED'],SELECT AVG(course_count) FROM (SELECT departme...,SELECT AVG(course_count) FROM (SELECT DEPARTME...
13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","['FCLT_ROOMS', 'FCLT_BUILDING']","""SELECT COUNT(*) FROM rooms WHERE building_id ...",SELECT COUNT(*) FROM FCLT_ROOMS WHERE FCLT_BUI...
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","['SPACE_UNIT', 'FCLT_ROOMS', 'FCLT_BUILDING']","SELECT building_id, COUNT(space_unit_id) AS Nu...","SELECT FCLT_BUILDING.BUILDING_NUMBER, COUNT(SP..."
15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...,['CIS_COURSE_CATALOG'],SELECT start_date FROM courses WHERE descripti...,SELECT COURSE_CATALOG_SUBJECT_OFFERED.SUBJECT_...
16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...,['CIS_COURSE_CATALOG'],"SELECT department_name, COUNT(*) AS course_cou...","SELECT DEPARTMENT_NAME, COUNT(*) AS NUMBER_OF_..."
17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO...",['EMPLOYEE_DIRECTORY'],SELECT office_location FROM faculty_info WHERE...,SELECT OFFICE_LOCATION FROM EMPLOYEE_DIRECTORY...
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC...",['EMPLOYEE_DIRECTORY'],"SELECT a.employee_id, a.employee_name FROM mit...","SELECT a.FULL_NAME FROM EMPLOYEE_DIRECTORY a, ..."
19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl...","['SUBJECT_SUMMARY', 'SUBJECT_ENROLLABLE']","""SELECT subject_name FROM subjects WHERE enrol...",SELECT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE W...
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI...",['MIT_STUDENT_DIRECTORY'],"SELECT department_id, COUNT(student_id) AS stu...","SELECT DEPARTMENT, COUNT(*) AS STUDENT_COUNT F..."
21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,['IAP_SUBJECT_CATEGORY'],SELECT DISTINCT category FROM independent_acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n...","['ZIP_USA', 'ZIP_CANADA']",SELECT city FROM addresses WHERE postcode = 501;,SELECT CITY_NAME FROM ZIP_USA WHERE ZIP_CODE =...
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...,['EMPLOYEE_DIRECTORY'],SELECT COUNT(*) FROM employees,SELECT COUNT(*) FROM EMPLOYEE_DIRECTORY
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_...",['STUDENT_DEPARTMENT'],"SELECT school_name, COUNT(department_name) as ...","SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_..."
25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM...",['EMPLOYEE_DIRECTORY'],"SELECT name, kerberos_id, email FROM employees...","SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS FROM..."
26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...,['STUDENT_DEPARTMENT'],"SELECT SCHOOL_NAME FROM \n(SELECT SCHOOL_NAME,...","SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_..."
27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ...",['COURSE_CATALOG_SUBJECT_OFFERED'],"SELECT course_id, course_name FROM courses WHE...","SELECT SUBJECT_ID, SUBJECT_TITLE, MAX(TOTAL_UN..."
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...,['TOP_LEVEL_DOMAIN'],SELECT TDL FROM TDL_Country WHERE Country_Name...,SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN ...
29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ...","['COURSE_CATALOG_SUBJECT_OFFERED', 'ACADEMIC_T...",SELECT start_date FROM courses WHERE departmen...,SELECT DISTINCT ACADEMIC_TERMS.TERM_START_DATE...
30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_...",['SUBJECT_OFFERED'],"SELECT course_name, format FROM Courses WHERE ...","SELECT SUBJECT_TITLE, FORM_TYPE_DESC FROM SUBJ..."
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*...","['TIP_DETAIL', 'TIP_SUBJECT_OFFERED', 'TIP_MAT...","SELECT textbook_material, COUNT(*) AS usage_co...","SELECT TIP_MATERIAL_KEY, COUNT(*) AS Frequency..."
32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati...","['IAP_SUBJECT_DETAIL', 'IAP_SUBJECT_PERSON', '...","""SELECT activity_title, location, supervisor F...","SELECT IAP_SUBJECT_DETAIL.ACTIVITY_TITLE, IAP_..."
33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F...",['TIP_MATERIAL'],"SELECT title, isbn FROM materials ORDER BY pri...","SELECT TITLE, ISBN FROM TIP_MATERIAL ORDER BY ..."
34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a...","['SUBJECT_SUMMARY', 'ACADEMIC_TERMS_ALL']",SELECT * FROM subjects ORDER BY registration_d...,"SELECT SUBJECT_ID, TERM_CODE FROM SUBJECT_OFFE..."
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ...",['MIT_STUDENT_DIRECTORY'],SELECT COUNT(*) FROM Departments WHERE NumberO...,SELECT COUNT(DISTINCT DEPARTMENT) FROM MIT_STU...
36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...,"['WAREUSER.SE_PERSON', 'EMPLOYEE_DIRECTORY']","SELECT department_id, COUNT(DISTINCT payroll_r...","SELECT DEPARTMENT_NAME, COUNT(DISTINCT PRIMARY..."

In [291]:
tables = []
cnt = 0 
for q in df_q['sql']: 
    print(q)
    cnt = cnt + 1
    try: 
        t = Parser(q).tables
        tables.append([v.upper() for v in t])
    except:
        tables.append(None)
df_q['tables_referred'] = tables

SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);
SELECT department_id, COUNT(*) AS course_count FROM wareuser.cis_course_catalog GROUP BY department_id;
SELECT DISTINCT subject_title, effective_term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM cis_course_catalog, academic_terms WHERE effective_term_code = term_code;
SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);
SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, subject_enrollable WHERE offer_dept_code = department GROUP BY full_name);
SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;
SELECT DISTINCT subject_title, term_end_date - term_start_date FROM (SELECT MIN(term_end_date - term_start_date) AS min_duration FROM academic_terms), academic_terms, cis_course_catalog WHERE effective_term_code = term_code AND term_end_date - term_start_date = min_duration;
SELECT fb.building_name, fba.* FROM wareuser.fac_building fb INNER JOIN wareuser.fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;
SELECT COUNT(*) FROM mit_student_directory;
SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;
SELECT DISTINCT city_name FROM zip_usa UNION SELECT DISTINCT city_name FROM zip_canada;
SELECT AVG(offered_subject_nr) FROM (SELECT DISTINCT offer_dept_name, COUNT(*) OVER (PARTITION BY offer_dept_name) AS offered_subject_nr FROM subject_offered) WHERE offered_subject_nr >= 100;
SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;
SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM space_unit, fclt_rooms, fclt_building WHERE fclt_rooms.FCLT_ORGANIZATION_KEY = space_unit.FCLT_ORGANIZATION_KEY AND fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;
SELECT COUNT(*) FROM cis_course_catalog WHERE subject_description LIKE '%regular%' OR subject_description LIKE '%initial%';
SELECT * FROM (SELECT DISTINCT department_name, COUNT(*) OVER (PARTITION BY department_name) AS numcourses FROM cis_course_catalog ORDER BY numcourses DESC) WHERE rownum <= 3;
SELECT Room, floor, fac_building_address.* FROM (SELECT office_location FROM employee_directory WHERE full_name = 'Stonebraker, Michael'), fac_rooms, fac_building_address WHERE office_location = fac_room_key AND fac_rooms.building_key = fac_building_address.BUILDING_KEY;
SELECT DISTINCT MIT_ID, employee.* FROM (SELECT full_name, COUNT(*) OVER (PARTITION BY full_name) AS cnt FROM employee_directory) employee, employee_directory WHERE employee.full_name = employee_directory.full_name AND cnt >= 2 ORDER BY employee.full_name;
SELECT DISTINCT se.subject_id, se.subject_title FROM subject_summary su, subject_enrollable se WHERE se.subject_id = su.subject_id AND department_name = 'Electrical Eng & Computer Sci';
SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) FROM mit_student_directory;
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
SELECT COUNT(*) FROM ((SELECT zip_code, city_name FROM zip_usa) UNION (SELECT postal_code, city_name FROM zip_canada)) WHERE zip_code = '00501';
SELECT COUNT(DISTINCT MIT_ID) FROM employee_directory;
SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) FROM student_department;
SELECT full_name, krb_name, email_address FROM employee_directory WHERE first_name = 'Michael';
SELECT * FROM (SELECT * FROM (SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) AS cnt FROM student_department) ORDER BY cnt DESC) WHERE rownum <= 1;
SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, (SELECT MAX(total_units) AS maxi FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE total_units = maxi;
SELECT * FROM top_level_domain WHERE top_level_domain_description = 'Brazil';
SELECT DISTINCT * FROM (SELECT subject_title, department_name, term_start_date, term_end_date - term_start_date AS duration FROM course_catalog_subject_offered a, academic_terms_all b WHERE a.term_code = b.term_code AND department_name = 'Electrical Eng & Computer Sci') WHERE duration <= 100;
SELECT DISTINCT subject_title, form_type, num_enrolled_students FROM subject_offered WHERE num_enrolled_students > 800;
SELECT * FROM (SELECT c.title, c.isbn, COUNT(*) OVER (PARTITION BY c.title, c.isbn) AS cnt FROM tip_detail a, tip_subject_offered b, tip_material c WHERE is_no_course_material LIKE 'N' AND a.tip_subject_offered_key = b.tip_subject_offered_key AND a.material_key = c.material_key) ORDER BY cnt DESC;
SELECT DISTINCT activity_title, session_location, term_start_date, person_name AS Leader FROM iap_subject_detail a, iap_subject_person b, academic_terms_all c, iap_subject_session d WHERE a.iap_subject_person_key = b.iap_subject_person_key AND a.iap_subject_session_key = d.iap_subject_session_key AND c.term_code = a.term_code AND b.person_role = 'Activity leader';
SELECT DISTINCT title, isbn, new_shelf_price FROM tip_material ORDER BY new_shelf_price ASC;
SELECT subject_title FROM subject_summary c, academic_terms_all d, (SELECT MIN(academic_year) AS mini FROM subject_summary a, academic_terms_all b WHERE a.term_code = b.term_code) WHERE c.term_code = d.term_code AND d.academic_year = mini;
SELECT COUNT(*) FROM (SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) AS cnt FROM mit_student_directory) WHERE cnt <= 300;
SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;

In [325]:
accuracy = []
for t0, t1 in zip(df_q['tables_referred'], df_q['gpt_sql_global_schema_retrieved']):
    a = None 
    k='WAREUSER'
    f = False
    for t in t0:
        # ignore the sql queries referring to the tables with the 'WAREUSER' 
        # prefix, for which we didn't find the schemas in the schema directory 
        if t.find(k) > -1: 
            f = True
            break
    if t0 and t1 and not f: 
        a = len(set(t0).intersection(set(t1)))/len(t0)
    accuracy.append(a)
df_q['gpt_sql_global_schema_accuracy']=accuracy